EDT/УТ/src/Catalogs/ИсточникиДанныхБазы1С/ИсточникиДанныхБазы1С.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИсточникиДанныхБазы1С</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>База</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинСерв</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольСерв</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасположениеБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаСоединения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФПоказатьПароль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФТипБазыФайловая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФСоединениеПротестировано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКонфигурации</name>
    <type>
      <types>EnumRef.ТипыКонфигураций1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьКонтрагентов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтатьиДДСЖурналРасходов</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеСтатьиДДСЖурналРасходов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/ИсточникиДанныхБазы1С/ObjectModule.bsl
Процедура СформироватьСтрокуСоединения() Экспорт
	//файловая: Параметры = "File=" + Каталог + ";Usr=" + Пользователь + ";Pwd=" + Пароль + ";";	
	//серверная: Параметры = "Srvr=" + Сервер + ";Ref=" + База + ";Usr=" + Логин + ";Pwd=" + Пароль + ";";	
	Если ФТипБазыФайловая Тогда 
		СтрокаСоединения = "File=" + СокрлП(РасположениеБазы)+ ";Usr=" + СокрлП(Логин) + ";Pwd=" + СокрлП(Пароль) + ";";
	Иначе
		СтрокаСоединения = "Srvr=" + СокрлП(Сервер) + ";Ref=" + СокрлП(База) + ";Usr=" + СокрлП(ЛогинСерв) + ";Pwd=" + СокрлП(ПарольСерв) + ";";
	КонецЕсли;
КонецПроцедуры

Функция РазложитьСтрокуВМассивПодстрокЛокально(Знач Стр, Разделитель = ",") Экспорт	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
КонецФункции
